freelance/models/Usuario.php

    public static function findIdentity($id)
    {
        return static::findOne(['usu_id' => $id, 'usu_estado' => self::USU_ESTADO_ACTIVO, 'usu_eliminado' => 0]);
---
SELECT * FROM `usuario` WHERE (`usu_id`=18) AND (`usu_estado`='Activo') AND (`usu_eliminado`=0)

    public static function findByUsername($username)
    {
        return static::findOne(['usu_login' => $username, 'usu_estado' => self::USU_ESTADO_ACTIVO, 'usu_eliminado' => 0]);
---
SELECT * FROM `usuario` WHERE (`usu_login`='pruebas sa') AND (`usu_estado`='Activo') AND (`usu_eliminado`=0)