freelance/views/factura/update.php

SELECT * FROM `concepto_facturacion`
SELECT * FROM `iva` WHERE `iva_id` IN (1, 3, 2)
---
$urlDatos = Url::to(['factura/datos-cliente']);

// Cargamos los conceptos disponibles para autocompletar/llenar filas
$conceptos = \app\models\ConceptoFacturacion::find()->with('iva')->all();