freelance/views/empresa/create.php

SELECT * FROM `tipo_doc_identidad`
---
                            <?= $form->field($empresa, 'emp_razon_social')->textInput(['maxlength' => true])->label('Nombre/Razón Social') ?>
                        </div>
                        <div class="col-12 col-md-4">
                            <?= $form->field($empresa, 'tdo_id')->dropDownList(
                                ArrayHelper::map(TipoDocIdentidad::find()->all(), 'tdo_id', 'tdo_nombre'),
                                ['prompt' => 'Seleccione']
                            )->label('Tipo Documento *') ?>