freelance/views/presupuesto/create.php

SELECT * FROM `concepto_facturacion`
SELECT * FROM `iva` WHERE `iva_id` IN (1, 3, 2)
---

// Cargamos los conceptos disponibles para autocompletar/llenar filas
// TODO: Change ConceptoFacturacion to ConceptoPresupuesto if it exists
$conceptos = \app\models\ConceptoFacturacion::find()->with('iva')->all();