freelance/views/presupuesto/update.php

$urlListadoProvincias = Url::to(['presupuesto/listado-provincias']);

// Cargamos los conceptos disponibles para autocompletar/llenar filas
$conceptos = \app\models\ConceptoFacturacion::find()->with('iva')->all();
---
SELECT * FROM `concepto_facturacion`
SELECT * FROM `iva` WHERE `iva_id` IN (1, 3, 2)