freelance/controllers/BancoController.php

    protected function findModel($ban_id)
    {
        if (($model = Banco::findOne(['ban_id' => $ban_id])) !== null) {
---
SELECT * FROM `banco` WHERE `ban_id`='1'