freelance/controllers/ClienteController.php

public function actionCreate()
    {
        $model = new Cliente();
        $transaction = Yii::$app->db->beginTransaction();

        try {
            if ($this->request->isPost) {
                if ($model->load($this->request->post()) && $model->save()) {

                    $valorActual = $model->cli_numero;
                    Consecutivo::deleteAll(['con_serie' => 'C']);
                    $nuevoConsecutivo = new Consecutivo(['con_serie' => 'C', 'con_consecutivo' => $valorActual]);

                    if (!$nuevoConsecutivo->save()) {
---
INSERT INTO `cliente` (`cli_numero`, `tdo_id`, `cli_docinipais`, `cli_feccaddoc`, `cli_numdocide`, `cli_nombre`, `cli_persona_contacto`, `cli_tel1`, `cli_tel2`, `cli_direccion`, `cli_poblacion`, `pai_id`, `prv_id`, `cli_codpostal`, `cli_email`, `cli_cuenta_contable`, `iva_id`, `cli_observaciones`, `cli_estado`, `cli_eliminado`, `fdp_id`, `soc_id`, `cli_exportado`) VALUES (27635, 1, NULL, NULL, 'q', 'Cliente D', 'Carlos Ruiz', '3101234569', '123', 'Calle C', 'Madrid', 73, 11, '28003', 'clienteD@mail.com', NULL, NULL, NULL, 'Activo', 0, 1, 1, 0)
DELETE FROM `consecutivo` WHERE `con_serie`='C'
INSERT INTO `consecutivo` (`con_serie`, `con_consecutivo`) VALUES ('C', 27635)