freelance/controllers/ClienteController.php

    protected function findModel($cli_id)
    {
        if (($model = Cliente::findOne(['cli_id' => $cli_id])) !== null) {
---
SELECT * FROM `cliente` WHERE `cli_id`='16'

    public function actionProvinciasPorPais($id)
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $provincias = Provincia::find()
            ->where(['pai_id' => $id])
            ->orderBy('prv_nombre')
            ->all();
---
SELECT * FROM `provincia` WHERE `pai_id`='73' ORDER BY `prv_nombre`