freelance/controllers/FacturaController.php

SELECT * FROM `consecutivo` WHERE `con_serie`='F'
---
            $model->fac_estado = Factura::FAC_ESTADO_SIN_PAGAR;

            // Cargar consecutivo
            $consecutivo = Consecutivo::findOne(['con_serie' => 'F']);

SELECT * FROM `socio`
SELECT * FROM `forma_de_pago`
SELECT * FROM `banco` WHERE `ban_eliminado`=0
SELECT * FROM `cliente` WHERE `cli_id`='2'
---
            $model->fac_fecha = date('d/m/Y');
        }

        $socios = \app\models\Socio::find()->all();
        $formasDePago = \app\models\FormaDePago::find()->all();

    // Bancos disponibles para seleccionar cuenta de transferencia
    $bancos = \app\models\Banco::find()->where(['ban_eliminado' => 0])->all();
    $bancosMap = ArrayHelper::map($bancos, 'ban_id', function($b){ return $b->ban_nombre . ' - ' . $b->ban_numcuenta; });

        $renderMethod = $this->request->isAjax ? 'renderAjax' : 'render';
        return $this->$renderMethod('create', [
            'model' => $model,
            'clientes' => [], // Se cargan por AJAX
            'socios' => ArrayHelper::map($socios, 'soc_id', 'soc_nombre'),
            'formasDePago' => ArrayHelper::map($formasDePago, 'fdp_id', 'fdp_nombre'),
            'bancos' => $bancosMap,
            'selectedBanco' => null,
        ]);

SELECT * FROM `cliente` WHERE `cli_id`='2'
---
    public function actionDatosCliente($id)
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $cliente = \app\models\Cliente::findOne($id);

SELECT * FROM `factura` WHERE (`fac_id`='1') AND (`fac_eliminada`=0)
---
    protected function findModel($fac_id)
    {
        if (($model = Factura::findOne(['fac_id' => $fac_id, 'fac_eliminada' => 0])) !== null) {