freelance/controllers/FacturaController.php

SELECT * FROM `factura` WHERE (`fac_id`='1') AND (`fac_eliminada`=0)
---
    protected function findModel($fac_id)
    {
        if (($model = Factura::findOne(['fac_id' => $fac_id, 'fac_eliminada' => 0])) !== null) {