freelance/controllers/PresupuestoController.php

SELECT * FROM `banco` WHERE `ban_eliminado`=0
---
        $formasDePago = \app\models\FormaDePago::find()->all();

    // Bancos disponibles para seleccionar cuenta de transferencia
    $bancos = \app\models\Banco::find()->where(['ban_eliminado' => 0])->all();

SELECT * FROM `presupuesto` WHERE (`pre_id`='1') AND (`pre_eliminado`=0)
---
    protected function findModel($pre_id)
    {
        if (($model = Presupuesto::findOne(['pre_id' => $pre_id, 'pre_eliminado' => 0])) !== null) {