freelance/controllers/PresupuestoController.php

SELECT * FROM `cliente` WHERE `cli_eliminado`=0
SELECT * FROM `socio`
SELECT * FROM `forma_de_pago`
---
        } else {
            $model->loadDefaultValues();
            // Pre-rellenar el modelo con valores por defecto para que se pueda guardar
            $primerCliente = \app\models\Cliente::find()->where(['cli_eliminado' => 0])->one();
            $primerSocio = \app\models\Socio::find()->one();
            $primeraFormaDePago = \app\models\FormaDePago::find()->one();

SELECT * FROM `socio`
SELECT * FROM `forma_de_pago`
SELECT * FROM `banco` WHERE `ban_eliminado`=0
---
            $model->pre_logo = Presupuesto::PRE_LOGO_EMPRESA;
        }

        $socios = \app\models\Socio::find()->all();
        $formasDePago = \app\models\FormaDePago::find()->all();

    // Bancos disponibles para seleccionar cuenta de transferencia
    $bancos = \app\models\Banco::find()->where(['ban_eliminado' => 0])->all();

SELECT * FROM `cliente` WHERE `cli_id`='2'
---
    public function actionDatosCliente($id)
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $cliente = \app\models\Cliente::findOne($id);

SELECT * FROM `detalle_presupuesto` WHERE `pre_id`=1
SELECT * FROM `cuentas_presupuesto` WHERE `pre_id`=1
---
    public function actionUpdate($pre_id)
    {
        $model = $this->findModel($pre_id);
        $detalleModels = $model->detallePresupuestos;
        $cuentasPresupuesto = $model->cuentasPresupuestos;
        $selectedBanco = null;
        if (!empty($cuentasPresupuesto)) {
            $selectedBanco = $cuentasPresupuesto[0]->ban_id;
        }

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->validate()) {

SELECT * FROM `socio`
SELECT * FROM `forma_de_pago`
SELECT * FROM `banco` WHERE `ban_eliminado`=0
---
            }
        }

        $socios = \app\models\Socio::find()->all();
        $formasDePago = \app\models\FormaDePago::find()->all();
        $bancos = \app\models\Banco::find()->where(['ban_eliminado' => 0])->all();

SELECT * FROM `presupuesto` WHERE (`pre_id`='1') AND (`pre_eliminado`=0)
---
    protected function findModel($pre_id)
    {
        if (($model = Presupuesto::findOne(['pre_id' => $pre_id, 'pre_eliminado' => 0])) !== null) {