freelance/controllers/UsuarioController.php

    protected function findModel($usu_id)
    {
        if (($model = Usuario::findOne(['usu_id' => $usu_id])) !== null) {
---
SELECT * FROM `usuario` WHERE `usu_id`='15'